[
  {
    "title": "Stardust Study Resets How Life’s Atoms Spread Through Space",
    "link": "https://astrobiology.com/2025/12/stardust-study-resets-how-lifes-atoms-spread-through-space.html",
    "score": 81,
    "summary": "The study provides insights into the distribution of life's building blocks in space, which is relevant to understanding the origins of life and the processes that may lead to abiogenesis.",
    "abstract": "<p>Starlight and stardust are not enough to drive the powerful winds of giant stars, transporting the building blocks of life through our galaxy. That’s the conclusion of a new study from Chalmers University of Technology, Sweden, of red giant star R Doradus. The result overturns a long-held idea about how the atoms needed for life […]</p> \n<p>The post <a href=\"https://astrobiology.com/2025/12/stardust-study-resets-how-lifes-atoms-spread-through-space.html\">Stardust Study Resets How Life’s Atoms Spread Through Space</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "published": "2025-12-29T19:34:52+00:00"
  },
  {
    "title": "Designing Peptide Fossils That Model the Evolution of the Bacterial Ferredoxin Fold",
    "link": "https://astrobiology.com/2025/12/designing-peptide-fossils-that-model-the-evolution-of-the-bacterial-ferredoxin-fold.html",
    "score": 85,
    "summary": "The paper discusses the evolution of bacterial ferredoxins, which are crucial for understanding early protein functions and electron transfer mechanisms relevant to the origins of life.",
    "abstract": "<p>Electron transfer coupled to redox chemistry is at the heart of metabolism. The proteins responsible for moving electrons (protein electron carriers) must have emerged at the origin of life. The small iron–sulfur-binding bacterial ferredoxins were likely among these first proteins. Embedded within the ferredoxin sequence and structure is a symmetry that points to an ancient […]</p> \n<p>The post <a href=\"https://astrobiology.com/2025/12/designing-peptide-fossils-that-model-the-evolution-of-the-bacterial-ferredoxin-fold.html\">Designing Peptide Fossils That Model the Evolution of the Bacterial Ferredoxin Fold</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "published": "2025-12-29T18:35:40+00:00"
  },
  {
    "title": "Are we the Martians? The intriguing idea that life on Earth began on the red planet",
    "link": "https://phys.org/news/2025-12-martians-intriguing-idea-life-earth.html",
    "score": 85,
    "summary": "The paper explores the hypothesis that life on Earth may have originated from Mars, directly addressing questions related to abiogenesis and the origins of life.",
    "abstract": "How did life begin on Earth? While scientists have theories, they don't yet fully understand the precise chemical steps that led to biology, or when the first primitive life forms appeared.",
    "published": "2025-12-29T17:02:35+00:00"
  },
  {
    "title": "Evolution of the ribosomal exit tunnel through the eyes of the nascent chain",
    "link": "https://www.biorxiv.org/content/10.64898/2025.12.25.696519v1?rss=1",
    "score": 81,
    "summary": "This paper provides insights into the ribosomal exit tunnel's structure and function, which is relevant to understanding the early stages of protein biogenesis and the potential pathways for abiogenesis.",
    "abstract": "<p><img alt=\"biorxiv_logo_homepage7-5-small.png\" src=\"https://www.biorxiv.org/sites/default/files/images/biorxiv_logo_homepage7-5-small.png\" /></p>The ribosomal exit tunnel is a universally conserved feature of the large subunit that directs the nascent polypeptide chain into the cellular environment and is involved in co-translational folding, stalling, and antibiotic binding. While recent advances in cryo-EM have revealed domain-specific variations in ribosome structure, tunnel definition and comparative analyses have largely relied on pure geometric algorithms that often approximate the tunnel as a static, single tube with varying radius. Here, we present a functional, nascent-chain-centric characterisation of the exit tunnel across the tree of life, derived from all-atom molecular dynamics simulations using the most complete set of 55 distinct cytoplasmic ribosome structures. By mapping the steric accessibility through the \"eyes\" of the nascent chain (NC) at five different stages of translation, we reveal a topological and stage-dependent complexity invisible to static geometric approaches, demonstrating how tunnel accessibility dynamically changes during biosynthesis. We identify transiently accessible, bacteria-specific lateral branches (\"side tunnels\") that effectively expand the functional volume of the tunnel but may also serve as kinetic traps for the nascent chain. In contrast, we show that archaeal and eukaryotic ribosomes have structurally occluded these cavities by incorporating the protein eL39. These evolutionary \"plugs\" seal the tunnel wall and decrease its functional width. Collectively, our results demonstrate that the ribosome exit tunnel is not a simple linear tube, but a branched, lineage-specific landscape where accessibility is temporally gated by nascent chain length. This functional definition provides a new framework for understanding how ribosomal architecture modulates the early stages of protein biogenesis.",
    "published": "2025-12-29T13:20:36+00:00"
  }
]