[
  {
    "title": "[85] [Astrobiology] The Evolution in Coma Molecular Composition of Comet C/2017 K2 (PanSTARRS) Across the H2O Sublimation Zone: ALMA Imaging of an H2O-Dominated Coma",
    "link": "https://astrobiology.com/2025/12/the-evolution-in-coma-molecular-composition-of-comet-c-2017-k2-panstarrs-across-the-h2o-sublimation-zone-alma-imaging-of-an-h2o-dominated-coma.html",
    "score": 85,
    "summary": "The paper is highly relevant to the origins of life field, focusing on the molecular composition of a comet and its implications for understanding prebiotic chemistry.",
    "abstract": "<strong>Score:</strong> 85/100 | <strong>Category:</strong> Astrobiology<br /> \n        <strong>AI Summary:</strong> This study provides insights into the molecular composition of comet C/2017 K2, highlighting the significance of water sublimation and its implications for understanding the origins of life in the solar system.<br /> \n        <hr /> \n        <strong>Abstract:</strong><br /> \n        We report a survey of molecular emission from cometary volatiles using the Atacama Large Millimeter/Submillimeter Array (ALMA) toward comet C/2017 K2 (PanSTARRS) carried out on UT 2022 September 21, 22, and 23 at a heliocentric distance (rh) of 2.1 au. These measurements of HCN, CS, CO, CH3OH, and H2CO (along with continuum emission from dust) […] The post The Evolution in Coma Molecular Composition of Comet C/2017 K2 (PanSTARRS) Across the H2O Sublimation Zone: ALMA Imaging of an H2O-Dominated Coma appeared first on Astrobiology .<br /> \n        <br /> \n        <a href=\"https://astrobiology.com/2025/12/the-evolution-in-coma-molecular-composition-of-comet-c-2017-k2-panstarrs-across-the-h2o-sublimation-zone-alma-imaging-of-an-h2o-dominated-coma.html\">Read Full Paper</a>",
    "published": "2025-12-30T03:45:19+00:00"
  },
  {
    "title": "[81] [Unclassified] LinearCapR: Linear-time computation of per-nucleotide structural-context probabilities of RNA without base-pair span limits",
    "link": "https://www.biorxiv.org/content/10.64898/2025.12.26.696559v1?rss=1",
    "score": 81,
    "summary": "The paper presents a computational tool for RNA structural analysis, which is highly relevant to the origins of life research, particularly in understanding abiogenesis pathways.",
    "abstract": "<strong>Score:</strong> 81/100 | <strong>Category:</strong> Unclassified<br /> \n        <strong>AI Summary:</strong> The paper presents a novel computational tool for RNA structural analysis, which is relevant to understanding the molecular mechanisms that could inform abiogenesis pathways in astrobiology.<br /> \n        <hr /> \n        <strong>Abstract:</strong><br /> \n        Motivation: RNA molecules adopt dynamic ensembles of secondary structures, where the local structural context of each nucleotide--such as whether it resides in a stem or a specific type of loop--strongly shapes molecular interactions and regulatory function. Structural-context probabilities therefore provide a more functionally informative view of RNA folding than the minimum free energy structures or base-pairing probabilities. However, existing tools either require O(N3) time or employ span-restricted approximations that omit long-range base-pairs, limiting their applicability to large and biologically important RNAs. Results: We introduce LinearCapR, enabling linear-time, span-unrestricted computation of structural-context marginalized probabilities, using beam-pruned Stochastic Context Free Grammar-based computation. LinearCapR retains global ensemble features lost by span-limited methods and yields superior predictive power on bpRNA-1m(90) dataset, especially for multiloops and exterior regions, as well as long-distance stems. LinearCapR supports analysis of long RNAs, demonstrated on the full genome of SARS-CoV-2. Conclusions: LinearCapR provides the first base-pair-span-unrestricted, linear-time framework for RNA structural context analysis, retaining key thermodynamic ensemble features essential for functional interpretation. It enables large-scale studies of viral genomes, long non-coding RNAs, and downstream analyses such as RNA-binding protein site prediction. Availability: The source code of LinearCapR is available at https://github.com/hoget157/LinearCapR.<br /> \n        <br /> \n        <a href=\"https://www.biorxiv.org/content/10.64898/2025.12.26.696559v1?rss=1\">Read Full Paper</a>",
    "published": "2025-12-30T03:45:19+00:00"
  }
]