[
  {
    "title": "Cultural accumulation or stasis? The impact of imitation and early teaching on hominin cultural evolution",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): Laureano Castro, Daniel Castro-Cañadilla, Miguel Ángel Castro-Nogueira, Miguel Ángel Toro</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002515?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757781Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "Models how imitation and early teaching shape cumulative cultural evolution versus stasis in hominins, with minimal direct relevance to origins-of-life or astrobiology."
    }
  },
  {
    "title": "Evolutionary computation for reconstructing threshold networks of the tryptophan operon in <em>Escherichia coli</em>",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> BioSystems, Volume 259</p><p>Author(s): Gonzalo A. Ruz, Thomas Ledger, Matthew Macauley</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002928?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757249Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "Uses evolutionary computation to infer gene regulatory (threshold) networks for the E. coli tryptophan operon, offering general evolutionary/systems-biology context but limited direct relevance to origins-of-life research."
    }
  },
  {
    "title": "Nucleolar reorganization on stress depends on physicochemical changes due to nascent rRNA synthesis",
    "summary": "Successive maturation of ribosomal subunits occurs through multi-layered phase-separated structures of the cell nucleolus. The spatio-functional relationship between transcription of rRNA and nucleolar substructures and how this adapts to cellular stress remain incompletely understood. In this study, we resolve the sub nucleolar structures using expansion microscopy to reveal ordered structures of fibrillar center (FC) and dense fibrillar component (DFC) domains as nested shells, which is reorganized upon cellular stress like DNA damage or RNA polymerase I (RNAPI) inhibition. Direct visualization of nascent (5' ETS) and mature (28S) rRNA suggested that rRNA synthesis is the critical regulator of nucleolar size, and organization. Nucleolar reorganization upon stress emerges to be a direct function of nascent rRNA levels. Stress-induced transcription inhibition remodels the sub-nucleolar compartments from a viscoelastic state into solid-like condensates thereby perturbing the nucleolar pH gradient due to the missing rRNA scaffold. We show, that rather than signalling to mediate rDNA repair, nucleolar reorganization naturally arises primarily from reduced rRNA levels and the resultant biophysical restructuring of the nucleolus under cellular stress.",
    "url": "https://www.biorxiv.org/content/10.64898/2026.01.03.697456v1?rss=1",
    "published_date": "2026-01-03T00:00:00Z",
    "source_feed": "cell biology - biorXiv Preprints",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "Expansion microscopy shows nucleolar FC/DFC shell architecture reorganizes under stress primarily because reduced nascent rRNA transcription alters condensate material properties (viscoelastic to solid-like) and disrupts physicochemical gradients, highlighting RNA-driven phase behavior relevant to biophysical self-organization."
    }
  },
  {
    "title": "On the transitional character and regularity of planetary abiogenesis",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> BioSystems, Volume 259</p><p>Author(s): Serge Dolgikh</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002709?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757548Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 83,
      "summary": "Conceptual BioSystems paper arguing for regularities in planetary abiogenesis, framing origin-of-life emergence as a transitional process with potentially predictable features across planets."
    }
  },
  {
    "title": "Offworld Biotechnology Research: Advanced Space Experiment Processor-4 (ADSEP-4)",
    "summary": "<p>NASA astronaut and Expedition 73 Flight Engineer Zena Cardman inspects sample cassettes for installation into the Advanced Space Experiment Processor-4 (ADSEP-4) at the maintenance work area inside the International Space Station&#8217;s Harmony module. She was conducting research operations for the Pharmaceutical In-space Laboratory biotechnology experiment, which is investigating methods to advance pharmaceutical manufacturing in microgravity. [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/offworld-biotechnology-research-advanced-space-experiment-processor-4-adsep-4.html\">Offworld Biotechnology Research: Advanced Space Experiment Processor-4 (ADSEP-4)</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/offworld-biotechnology-research-advanced-space-experiment-processor-4-adsep-4.html",
    "published_date": "2026-01-02T16:44:55Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [],
    "analysis_result": {
      "score": 20,
      "summary": "ISS microgravity biotechnology operations (ADSEP-4) aimed at advancing in-space pharmaceutical manufacturing, with no direct connection to origins-of-life mechanisms or astrobiological biosignatures."
    }
  },
  {
    "title": "Recent Production Rates Of Cosmogenic Nuclides In The Igneous Rocks of Jezero Crater Floor, Mars",
    "summary": "<p>The Perseverance rover has collected rock samples from the floor of Jezero crater, Mars, set to be returned to Earth through the Mars Sample Return (MSR) mission. These surface rocks are continuously bombarded by cosmic rays, resulting in the formation of cosmogenic nuclides. To accurately date these rocks and understand past geological events, precise estimates [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/recent-production-rates-of-cosmogenic-nuclides-in-the-igneous-rocks-of-jezero-crater-floor-mars.html\">Recent Production Rates Of Cosmogenic Nuclides In The Igneous Rocks of Jezero Crater Floor, Mars</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/recent-production-rates-of-cosmogenic-nuclides-in-the-igneous-rocks-of-jezero-crater-floor-mars.html",
    "published_date": "2026-01-02T16:34:24Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://www.nature.com/articles/s41598-025-33031-5?utm_source=xmol&utm_medium=affiliate&utm_content=meta&utm_campaign=DDCN_1_GL01_metadata_scirep"
    ],
    "analysis_result": {
      "score": 50,
      "summary": "Quantifies cosmogenic nuclide production in Perseverance’s Jezero crater igneous samples to improve surface exposure/age estimates—useful Mars context for reconstructing timelines of potentially habitable conditions, though not directly focused on origins-of-life mechanisms."
    }
  },
  {
    "title": "The Natural history of the transition between RNA to DNA in the early stages of life",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> BioSystems, Volume 259</p><p>Author(s): Sávio Torres de Farias, Marco José</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002813?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757584Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 90,
      "summary": "Reviews and synthesizes hypotheses on how early life transitioned from RNA-based systems to DNA genomes, a core question in origins-of-life research."
    }
  },
  {
    "title": "Development and implementation of a tool for the analysis and circuit representation of steady-state alternating current circuits",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Celal Atalar, Selda Bayrak, Huseyin Pehlivan</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002510?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119304Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper describes a computational tool for analyzing and representing steady-state AC electrical circuits and has no apparent connection to origins-of-life research, astrobiology, habitability, or biosignatures."
    }
  },
  {
    "title": "Prevalence of prime mass residues in single point mutations and their importance to protein stability, function and evolution",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): Matthew Wright, Kevin M. Downard</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002485?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757808Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "Analyzes how prime-mass amino acid residues disproportionately appear in single-point mutations and explores their consequences for protein stability, function, and evolutionary dynamics, offering indirect context for molecular evolution relevant to origins-of-life discussions."
    }
  },
  {
    "title": "Information and the living tree of life: A theory of measurement grounded in biology",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): Kevin Hudnall</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002205?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757850Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 40,
      "summary": "A theoretical biology paper proposing a biology-grounded theory of measurement and information in the living tree of life, with only indirect relevance to origins-of-life questions."
    }
  },
  {
    "title": "Efficient utilization of streaming multiprocessors for the implementation of particle filter on graphics processing unit",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Özcan Dülger</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002558?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119391Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper focuses on GPU optimization for particle filter algorithms in computational science and has no direct connection to origins-of-life, astrobiology, habitability, or biosignature research."
    }
  },
  {
    "title": "Authigenic Biosignatures Of Microbial Biomass Preserved As Carbonate Ooids Formed By Abiotic Chemically Oscillating Reactions Throughout Earth History",
    "summary": "<p>Ooids are small spheroidal carbonate grains that have circularly concentric and radially aligned crystals. Oolitic carbonates are commonly associated with fossils or organic matter, which has led to hypothetical formation models involving both biological and abiotic processes. The most commonly invoked model involves precipitates from supersaturated CaCO3 water under high-energy conditions. However, this model does [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/authigenic-biosignatures-of-microbial-biomass-preserved-as-carbonate-ooids-formed-by-abiotic-chemically-oscillating-reactions-throughout-earth-history.html\">Authigenic Biosignatures Of Microbial Biomass Preserved As Carbonate Ooids Formed By Abiotic Chemically Oscillating Reactions Throughout Earth History</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/authigenic-biosignatures-of-microbial-biomass-preserved-as-carbonate-ooids-formed-by-abiotic-chemically-oscillating-reactions-throughout-earth-history.html",
    "published_date": "2026-01-02T16:23:15Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://pubs.geoscienceworld.org/gsa/gsabulletin/article/doi/10.1130/B38526.1/666459/Authigenic-biosignatures-of-microbial-biomass",
      "https://doi.org/10.1130/B38526.1/666459/Authigenic-biosignatures-of-microbial-biomass"
    ],
    "analysis_result": {
      "score": 70,
      "summary": "This study argues that carbonate ooids can form via abiotic chemically oscillating reactions while still preserving authigenic microbial biomass, sharpening how we interpret carbonate “biosignatures” (and potential abiotic mimics) in ancient Earth and planetary settings."
    }
  },
  {
    "title": "Humans and microbes: A systems theory perspective on coevolution",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): A.V. Melkikh</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002497?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.758005Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 40,
      "summary": "Systems-theory discussion of human–microbe coevolution, broadly relevant to evolutionary systems thinking but not directly focused on origins-of-life mechanisms or prebiotic/abiogenesis processes."
    }
  },
  {
    "title": "Lava Tubes On Earth, the Moon, And Mars: Detection, Evolution, And Exploration Potential",
    "summary": "<p>Lava tubes, or subsurface conduits formed by volcanic activity, have emerged as critical geological features for understanding planetary evolution and for supporting future human space exploration. This paper provides an integrated review of the formation, morphology, and preservation of lava tubes on Earth, the Moon, and Mars, emphasizing their geological significance and habitability potential. We [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/lava-tubes-on-earth-the-moon-and-mars-detection-evolution-and-exploration-potential.html\">Lava Tubes On Earth, the Moon, And Mars: Detection, Evolution, And Exploration Potential</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/lava-tubes-on-earth-the-moon-and-mars-detection-evolution-and-exploration-potential.html",
    "published_date": "2026-01-02T16:27:44Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://doi.org/10.1007/s11214-025-01260-9",
      "https://link.springer.com/article/10.1007/s11214-025-01260-9"
    ],
    "analysis_result": {
      "score": 65,
      "summary": "A review of lava tube formation, detection, and preservation on Earth, the Moon, and Mars, highlighting their relevance as potentially protective subsurface habitats and exploration targets rather than directly addressing prebiotic origins mechanisms."
    }
  },
  {
    "title": "Semi-Supervised Rotation Forest",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): José Miguel Ramírez-Sanz, David Martínez-Acha, Álvar Arnaiz-González, César García-Osorio, Juan J. Rodríguez</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002546?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119344Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops a semi-supervised machine-learning ensemble method (Rotation Forest) and does not address origins of life, prebiotic chemistry, habitability, or biosignatures."
    }
  },
  {
    "title": "Cooperation in structured populations via coupled reputation and learning: A spatial evolutionary game approach",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> BioSystems, Volume 258</p><p>Author(s): Shouwei Li, Bo Peng, Baochen Li, Yan Shi</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0303264725002400?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:37.757901Z",
    "source_feed": "Biosystems",
    "hunted_links": [],
    "analysis_result": {
      "score": 40,
      "summary": "Uses spatial evolutionary game theory to study how reputation and learning promote cooperation in structured populations, offering indirect conceptual context for evolutionary dynamics relevant to early-life cooperation but not addressing abiogenesis or astrobiological systems directly."
    }
  },
  {
    "title": "MOOSE ProbML: Parallelized probabilistic machine learning and uncertainty quantification for computational energy applications",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Somayajulu L.N. Dhulipala, Peter German, Yifeng Che, Zachary M. Prince, Xianjian Xie, Pierre-Clément A. Simon, Vincent M. Labouré, Hao Yan</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002534?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119369Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper focuses on parallelized probabilistic machine learning and uncertainty quantification for computational energy applications, with no clear connection to origins-of-life, prebiotic chemistry, habitability, or biosignature studies."
    }
  },
  {
    "title": "Heuristic Model On The Origin Of The Homochirality Of Life Heuristic Model On The Origin Of The Homochirality Of life",
    "summary": "<p>Life demonstrates remarkable homochirality of its major building blocks: nucleic acids, amino acids, sugars, and phospholipids. We propose a mechanism that places the root of life homochirality in the formation of phospholipid bilayer vesicles (liposomes). These liposomes are formed at the water-air interface from Langmuir layers and contain ribose, presumably delivered to Early Earth by [&#8230;]</p>\n<p>The post <a href=\"https://astrobiology.com/2026/01/heuristic-model-on-the-origin-of-the-homochirality-of-life-heuristic-model-on-the-origin-of-the-homochirality-of-life.html\">Heuristic Model On The Origin Of The Homochirality Of Life Heuristic Model On The Origin Of The Homochirality Of life</a> appeared first on <a href=\"https://astrobiology.com\">Astrobiology</a>.</p>",
    "url": "https://astrobiology.com/2026/01/heuristic-model-on-the-origin-of-the-homochirality-of-life-heuristic-model-on-the-origin-of-the-homochirality-of-life.html",
    "published_date": "2026-01-02T16:39:23Z",
    "source_feed": "Astrobiology (astrobiology.com)",
    "hunted_links": [
      "https://arxiv.org/abs/2512.11136",
      "https://doi.org/10.48550/arXiv.2512.11136"
    ],
    "analysis_result": {
      "score": 95,
      "summary": "An origins-of-life–focused heuristic model proposing that lipid vesicle (liposome) self-assembly at the water–air interface could drive the emergence of biomolecular homochirality, linking chirality to early protocell-like membrane formation and associated nucleic-acid building blocks."
    }
  },
  {
    "title": "Anastylosis of frescoes − optimal parallel performance via RINCCAS in a given HPC resource",
    "summary": "<p>Publication date: Available online 2 January 2026</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): Dimo Dimov, Sofiya Ivanovska, Aleksandar Dimov</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S187775032500256X?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119535Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper focuses on high-performance computing optimization for fresco reconstruction (anastylosis) and is unrelated to origins of life or astrobiology."
    }
  },
  {
    "title": "On qualitative uncertainty in modelling assumptions",
    "summary": "<p>Publication date: Available online 2 January 2026</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): Derek Groen, Laura M. Harbach</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002595?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119496Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 10,
      "summary": "Methodological discussion of qualitative uncertainty in modelling assumptions with no explicit connection to origins-of-life, astrobiology, habitability, or prebiotic chemistry."
    }
  },
  {
    "title": "Enhancing urban solar photovoltaic system performance evaluation through a disc spherical fuzzy aggregation framework",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Shahzaib Ashraf, Muhammad Shakir Chohan, Wania Iqbal, Vladimir Simic, Dragan Pamucar, Nebojsa Bacanin</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002352?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119581Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops a fuzzy-aggregation framework for evaluating urban solar photovoltaic performance, which is unrelated to origins-of-life research or astrobiology."
    }
  },
  {
    "title": "A liquid neural network with physical evolution for variable continuous time series prediction",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Kui Qian, Yue Deng, Zhengyan Li, Xiulan Wen</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002340?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119479Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "This paper develops a liquid neural network framework for variable continuous time-series prediction and is largely unrelated to origins-of-life or astrobiology, aside from the generic use of the term \"evolution\" in its title."
    }
  },
  {
    "title": "A novel deep transfer learning model with a bidirectional quasi-recurrent neural network for underwater object classification from aquarium images",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Tabeer Jan, Lavanya Madhuri Bollipo</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002522?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119404Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "This paper develops a deep learning model for classifying underwater objects in aquarium images and has no meaningful connection to origins-of-life or astrobiology beyond a superficial association with water."
    }
  },
  {
    "title": "ENOF:Outlier detection algorithm based on Elastic Neighborhood Outlier Factor",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Zhongping Zhang, Jinyu Dong, Kuo Wang, Zhongman Wang</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002431?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119451Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper presents a computational outlier-detection algorithm (ENOF) and does not address origins-of-life, prebiotic chemistry, biosignatures, habitability, or other astrobiological topics."
    }
  },
  {
    "title": "A local–global Graph Transformer model for fluid dynamics simulations",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): Jiamin Jiang, Jingrun Chen, Zhouwang Yang</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002509?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119432Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper presents a machine-learning (graph transformer) approach for accelerating or improving fluid dynamics simulations and does not address origins-of-life, prebiotic chemistry, habitability, or biosignatures."
    }
  },
  {
    "title": "Algorithm for segmentation of multimodally distributed time series in accordance with their modes",
    "summary": "<p>Publication date: February 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 94</p><p>Author(s): V.S. Petrakova, E.D. Karepova</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S187775032500242X?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119468Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper presents a general algorithm for segmenting multimodally distributed time series and does not address origins-of-life, astrobiology, habitability, biosignatures, or related prebiotic/evolutionary processes."
    }
  },
  {
    "title": "Graph anomaly detection via local contrastive learning and attribute reconstruction",
    "summary": "<p>Publication date: Available online 2 January 2026</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): Xinyu Zhang, Yanfen Li</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002583?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119513Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Machine-learning methods for graph anomaly detection and attribute reconstruction, with no apparent connection to origins-of-life chemistry, evolution, habitability, or biosignature detection."
    }
  },
  {
    "title": "Two improved physics-informed Neural Networks for solving Burgers equation",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Zeyue Zhang, Chunlei Ruan, Zhijun Liu</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002339?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119616Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops improved physics-informed neural networks for solving the Burgers equation, a computational PDE benchmark with no direct relevance to origins of life or astrobiology topics."
    }
  },
  {
    "title": "Exploring network-level indicators for project analysis — A comparison of real and synthetic projects",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Zsolt T. Kosztyán</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002224?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119600Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper appears to focus on network-level metrics for analyzing real versus synthetic project management data, with no evident connection to origins of life, astrobiology, habitability, or biosignatures."
    }
  },
  {
    "title": "ELM-UNet: An efficient and lightweight Vision Mamba UNet for skin lesion segmentation",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Songling Xia, Hongwei Deng, Feng Chen</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002200?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119693Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper presents a lightweight Vision Mamba UNet model for medical image (skin lesion) segmentation and has no substantive connection to origins-of-life, astrobiology, habitability, or biosignature research."
    }
  },
  {
    "title": "Fuzzy data imputation with DIMP and FGAIN",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Maciej Romaniuk, Przemysław Grzegorzewski</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002157?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119715Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops fuzzy data imputation methods (DIMP and FGAIN) for handling missing data, with no direct relevance to origins-of-life, prebiotic chemistry, habitability, or biosignature research."
    }
  },
  {
    "title": "Safe merging aircraft flows in multi-route schemes",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Arseniy A. Spiridonov</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002182?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119654Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper on safe merging of aircraft flows in multi-route schemes is unrelated to origins-of-life, astrobiology, habitability, or biosignature research and contains no relevant target keywords."
    }
  },
  {
    "title": "Computational modeling of incompressible two-phase fluid dynamics via the conservative Allen–Cahn framework on a virtual cube",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Ahmed Zeeshan, Juho Ma, Zhengang Li, Xinpei Wu, Junseok Kim</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002327?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119558Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops a numerical method for incompressible two-phase fluid dynamics (Allen–Cahn framework) with no clear connection to origins-of-life chemistry, biosignatures, habitability, or other astrobiological themes."
    }
  },
  {
    "title": "Thought Management System for long-horizon, goal-driven LLM agents",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Andrii Bidochko, Yaroslav Vyklyuk</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002170?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119632Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper focuses on managing long-horizon, goal-driven LLM agents and has no apparent connection to origins-of-life, astrobiology, habitability, or prebiotic chemistry topics."
    }
  },
  {
    "title": "Local method of fundamental solutions formulations for polyharmonic BVPs",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Andreas Karageorghis, C.S. Chen, Malgorzata A. Jankowska</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002194?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119676Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops numerical formulations for solving polyharmonic boundary value problems and has no direct connection to origins-of-life, astrobiology, habitability, or biosignature research."
    }
  },
  {
    "title": "Parallel sparsity patterns for factored incomplete inverse matrices",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Christos K. Filelis-Papadopoulos, George A. Gravvanis</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002133?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119763Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops parallel sparsity patterns for factored incomplete inverse matrices in numerical linear algebra, with no apparent connection to origins-of-life, astrobiology, habitability, or biosignature research."
    }
  },
  {
    "title": "Editorial Board",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): </p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S187775032500239X?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119814Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This item appears to be an editorial board listing with no scientific content or links, offering no relevance to origins-of-life or astrobiology topics."
    }
  },
  {
    "title": "Efficient cellular automata-Lattice Boltzmann method for modeling solidification microstructure",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Jingjing Wang, Xiaoyu Liu, Ruina Mao</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002121?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119799Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Computational materials-science method for simulating solidification microstructure, with no apparent connection to origins-of-life, prebiotic chemistry, habitability, or biosignatures."
    }
  },
  {
    "title": "A Novel Exact Solution of Extended Single Particle Model for Lithium-ion Cell and Its Application to High Capacity NMC Battery",
    "summary": "<p>Publication date: Available online 31 December 2025</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): Arif Ullah Khan, Mahvish Samar, Arif Hussain, Mei Li, Wenting Xu, Zhiyu Mao, Zhongwei Chen</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002571?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119850Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper presents an exact solution for an extended single-particle model of lithium-ion NMC batteries, with no apparent connection to origins-of-life, astrobiology, habitability, or biosignatures."
    }
  },
  {
    "title": "A nonlinear finite volume scheme preserving positivity for the numerical simulation of groundwater contaminant transport in porous media",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Sadiq Hamidi, Mustapha El Ossmani, Abdelaziz Taakili</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002169?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119746Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 5,
      "summary": "Develops a positivity-preserving nonlinear finite volume numerical scheme for simulating contaminant transport in groundwater porous media, with only tangential relevance to astrobiology via general water/transport modeling."
    }
  },
  {
    "title": "Temporal carbon neutral Chinese knowledge graph completion method based on latent semantic mining",
    "summary": "<p>Publication date: Available online 31 December 2025</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): Xiping Zhu, Lijuan Xiao, Ang Gao, Lu Guo, Huan Yang</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002212?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119831Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper focuses on temporal carbon-neutral Chinese knowledge graph completion using latent semantic mining, with no apparent connection to origins-of-life, astrobiology, habitability, or biosignatures."
    }
  },
  {
    "title": "Corrigendum to “Towards universal MPI bindings for enhanced new language support” [J. Comput. Sci. 87 (2025), 102557]",
    "summary": "<p>Publication date: Available online 22 October 2025</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): César Piñeiro, Álvaro Vázquez, Juan C. Pichel</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325001516?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119870Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Corrigendum about universal MPI bindings for programming language support, with no apparent connection to origins of life, astrobiology, habitability, or biosignatures."
    }
  },
  {
    "title": "A generalized colouring method for a parallelizable integer linear programming approach to polyomino tiling",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Marcus R. Garvie, John Burkardt</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S187775032500211X?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119780Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops a computational optimization method (coloring for parallelizable integer linear programming) for polyomino tiling, with no direct connection to origins-of-life, astrobiology, habitability, or biosignature research."
    }
  },
  {
    "title": "Computational model of ammonia synthesis with catalyst pellets: Linking the structure and performance",
    "summary": "<p>Publication date: January 2026</p><p><b>Source:</b> Journal of Computational Science, Volume 93</p><p>Author(s): Michael Abeiku Daniels, Anna Geohagan, Agnieszka Truszkowska</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002145?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119734Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Computational modeling of industrial-style ammonia synthesis over catalyst pellets is primarily chemical engineering/catalysis and does not directly address prebiotic chemistry, abiogenesis, or other origins-of-life/astrobiology themes."
    }
  },
  {
    "title": "Artificial intelligence and high-performance computing for advanced simulations",
    "summary": "<p>Publication date: Available online 8 October 2025</p><p><b>Source:</b> Journal of Computational Science</p><p>Author(s): Maciej Paszyński, David Pardo, Barbara Strug</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1877750325002078?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.119890Z",
    "source_feed": "Journal of Computational Science",
    "hunted_links": [],
    "analysis_result": {
      "score": 15,
      "summary": "Methods-focused paper on applying artificial intelligence and high-performance computing to advanced simulations, with no explicit connection to origins-of-life, prebiotic chemistry, biosignatures, or habitability topics."
    }
  },
  {
    "title": "A discrete-time continuous-space neural model for shell patterns in mollusks",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Rahnuma Islam, Bard Ermentrout, Sabrina Streipert</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003182?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321818Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Develops a discrete-time, continuous-space neural model to reproduce mollusk shell pattern formation, which is not directly relevant to origins-of-life, prebiotic chemistry, or astrobiological biosignatures."
    }
  },
  {
    "title": "Parameter-wise predictions and sensitivity analysis for random walk models in the life sciences",
    "summary": "<p>Publication date: 21 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 621</p><p>Author(s): Yihan Liu, David J. Warne, Matthew J. Simpson</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003315?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321738Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 15,
      "summary": "Methodological study developing parameter-wise prediction and sensitivity analysis tools for random-walk models in life sciences, with no direct connection to origins-of-life, prebiotic chemistry, or astrobiological habitability/biosignatures."
    }
  },
  {
    "title": "Dynamics of integrated multi-trophic aquaculture (IMTA): A modeling approach incorporating zooplankton and scavenger",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Honghui Gao, Ming Chen, Yuwei Liu</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003352?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321798Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 10,
      "summary": "A theoretical ecology model of nutrient and energy flows in integrated multi-trophic aquaculture (including zooplankton and scavengers), with little direct relevance to origins-of-life or astrobiological prebiotic processes."
    }
  },
  {
    "title": "Sucrose transport to the root and shoot in the seedling phloem",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Jacob M. Jepson, Leah R. Band</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325002759?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321912Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This theoretical biology paper on sucrose transport in seedling phloem concerns plant physiology and does not address origins of life, prebiotic chemistry, or astrobiology-relevant habitability/biosignature questions."
    }
  },
  {
    "title": "Stability-driven assembly theory",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Dan Adler</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003364?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321837Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 40,
      "summary": "Proposes a theoretical framework where stability constraints drive the assembly of complex structures, offering broad conceptual relevance to origins-of-life studies but with no explicit astrobiology or prebiotic chemistry focus in the available metadata."
    }
  },
  {
    "title": "Bistability in the regulatory system of the intrinsic apoptotic pathway arising from the Bax and Bcl-xL interactions",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Ruslan M. Timchenko, Mikhail A. Panteleev</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003285?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321856Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "A theoretical systems-biology study modeling bistability in the eukaryotic intrinsic apoptotic pathway via Bax–Bcl-xL interactions, with no direct relevance to origins-of-life, prebiotic chemistry, or astrobiology."
    }
  },
  {
    "title": "Emergent stable tissue shapes from the regulatory feedback between morphogens and cell growth",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Bivash Kaity, Daniel Lobo</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003388?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321894Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 40,
      "summary": "A theoretical model of morphogen–growth feedback producing stable tissue-scale shapes, relevant to later-stage biological organization (development/multicellularity) but only indirectly connected to origins-of-life mechanisms."
    }
  },
  {
    "title": "Timing the initiation of sex: Delay mechanisms alter fitness outcomes in a rotifer population model",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Bethany L.F. Stevens, Silke F. van Daalen, Tirzah J. Blomquist, Kristin E. Gribble, Michael G. Neubert</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003170?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321778Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 40,
      "summary": "A theoretical population model exploring how delaying the initiation of sex changes fitness outcomes in rotifers, offering general evolutionary context but little direct relevance to origins-of-life or astrobiology topics."
    }
  },
  {
    "title": "Semi-hydraulic actuation in spider legs: The transport of the hemolymph does not hamper muscle driven leg joint flexion",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Reinhard Blickhan, Tobias Siebert, Tom Weihmann</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003340?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321875Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Biomechanics study of spider leg hemolymph hydraulics and muscle-driven joint flexion, with no direct relevance to origins-of-life, prebiotic chemistry, or astrobiology."
    }
  },
  {
    "title": "Habitat fragmentation promotes spatial scale separation under resource competition",
    "summary": "<p>Publication date: Available online 30 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): James Austin Orgeron, Malbor Asllani</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003510?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321980Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 30,
      "summary": "A theoretical ecology study on how habitat fragmentation shapes spatial scale separation under resource competition, offering only indirect conceptual relevance to origins-of-life questions (e.g., spatial structuring and selection) and no explicit astrobiology/OoL focus."
    }
  },
  {
    "title": "Deciphering the modulatory role of direct pedunculopontine nucleus-cortical circuitry in absence seizure dynamics: A computational study",
    "summary": "<p>Publication date: Available online 29 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Bing Hu, Jiaqin Peng, Wencan Li, Yuhan Xiao, Ningmin Zhu</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003509?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.322005Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Computational neuroscience study on pedunculopontine nucleus–cortical circuitry in absence seizures, with no apparent connection to origins-of-life, prebiotic chemistry, or astrobiology topics."
    }
  },
  {
    "title": "A model of predation and survival in a system of three interacting species",
    "summary": "<p>Publication date: 7 March 2026</p><p><b>Source:</b> Journal of Theoretical Biology, Volume 620</p><p>Author(s): Anca Rǎdulescu, Richard Halpern, Drew Kozlowski</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003145?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321942Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 20,
      "summary": "A theoretical ecology model of predation and survival among three interacting species, with only indirect relevance to origins-of-life themes (evolutionary dynamics) and no explicit OoL/astrobiology keywords."
    }
  },
  {
    "title": "Can physical activity augment drug efficacy in PMO treatments - Insights from in-silico simulations of PTH and denosumab treatments",
    "summary": "<p>Publication date: Available online 21 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Rocío Ruiz-Lozano, José Luis Calvo-Gallego, Peter Pivonka, Javier Martínez-Reina</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003376?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.322042Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "In-silico modeling study on how physical activity may influence efficacy of osteoporosis-related drug treatments (PTH and denosumab), with no apparent connection to astrobiology or origins-of-life research."
    }
  },
  {
    "title": "A mixed-effects cosinor modelling framework for circadian gene expression",
    "summary": "<p>Publication date: Available online 2 November 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Michael T. Gorczyca</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325002851?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.322080Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper develops a mixed-effects cosinor statistical framework for analyzing circadian gene expression, which is not directly relevant to origins-of-life, prebiotic chemistry, or astrobiological habitability/biosignatures."
    }
  },
  {
    "title": "Modelling the spread and management of <em>Varroa Destructor</em> in naive European Honeybee populations",
    "summary": "<p>Publication date: Available online 3 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Isobel R. Abell, Thao P. Le, Jennifer A. Flegg, Christopher M. Baker</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003133?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.322061Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "A theoretical modelling study on the epidemiology and management of Varroa destructor in European honeybee populations, with no direct relevance to astrobiology or origins-of-life research."
    }
  },
  {
    "title": "Branch length statistics in phylogenetic trees under constant-rate birth-death dynamics",
    "summary": "<p>Publication date: Available online 31 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Tobias Dieselhorst, Johannes Berg</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S002251932500339X?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.321961Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "Develops statistical expectations for branch lengths in phylogenetic trees under constant-rate birth–death models, providing evolutionary inference tools that are only indirectly relevant to origins-of-life questions."
    }
  },
  {
    "title": "Informational inbreeding: a useful concept to add to extant evolutionary theories: Comment on “Homo informatio” by Michael J. Walker",
    "summary": "<p>Publication date: March 2026</p><p><b>Source:</b> Physics of Life Reviews, Volume 56</p><p>Author(s): Héctor M. Manrique, Ana Magdalena Hurtado</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001824?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.731400Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 45,
      "summary": "A theoretical commentary proposing “informational inbreeding” as a concept within evolutionary theory, offering only broad contextual relevance to origins-of-life research rather than direct prebiotic or abiogenesis insights."
    }
  },
  {
    "title": "Modeling network connectivity may reveal further insights on how transcranial alternating current stimulation modulates brain activity: Comment on “Entrainment by transcranial alternating current stimulation: Insights from models of cortical oscillations and dynamical systems theory” by M. Madadi Asl and A. Valizadeh",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> Physics of Life Reviews, Volume 55</p><p>Author(s): Heiko I. Stecher, Daniel Strüber, Christoph S. Herrmann</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001435?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.731966Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "Commentary on modeling how transcranial alternating current stimulation affects cortical network oscillations, with no discernible connection to origins-of-life, prebiotic chemistry, or astrobiology."
    }
  },
  {
    "title": "Simple rules for simple models",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> Physics of Life Reviews, Volume 55</p><p>Author(s): Arnaud Messé, Claus C. Hilgetag, Marc-Thorsten Hütt</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001575?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.731772Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 35,
      "summary": "A conceptual review likely discussing how simplified rule-based models can capture emergent biological complexity, offering broad methodological context but no explicit focus on prebiotic chemistry or abiogenesis from the available metadata."
    }
  },
  {
    "title": "Spatial Sucrose Sink Profiles Shape Phloem Transport Efficiency and Xylem-Phloem Water Exchange",
    "summary": "<p>Publication date: Available online 24 December 2025</p><p><b>Source:</b> Journal of Theoretical Biology</p><p>Author(s): Mazen Nakad, Aaron Potkay, Marc A. Hesse, Maurizio Mencuccini, Pierre Gentine, Ensheng Weng</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S0022519325003303?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.322019Z",
    "source_feed": "Journal of Theoretical Biology",
    "hunted_links": [],
    "analysis_result": {
      "score": 15,
      "summary": "A theoretical plant-physiology study modeling how spatial sucrose sink distributions affect phloem transport efficiency and xylem–phloem water exchange, with minimal direct relevance to origins-of-life research."
    }
  },
  {
    "title": "On implementation of nonlocal terms in models in ecology and evolution. Comment on ‘Nonlocal models in biology and life sciences: Sources, developments, and applications’ by S. Pal & R. Melnick",
    "summary": "<p>Publication date: March 2026</p><p><b>Source:</b> Physics of Life Reviews, Volume 56</p><p>Author(s): Andrew Yu Morozov</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001897?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.731217Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 25,
      "summary": "A technical comment on how to implement nonlocal terms in ecological and evolutionary models, with only indirect relevance to origins-of-life questions."
    }
  },
  {
    "title": "Making the private public: external grounding in inner States",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> Physics of Life Reviews, Volume 55</p><p>Author(s): Friedemann Pulvermüller, Michael Pauen</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001563?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.731722Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This paper appears to address philosophical/cognitive questions about grounding of internal mental states rather than origins-of-life chemistry, prebiotic evolution, habitability, or biosignatures."
    }
  },
  {
    "title": "Surfing brain waves without sinking: A commentary on “Entrainment by transcranial alternating current stimulation: Insight from models of cortical oscillations and dynamical systems theory” by M. Madadi Asl and A. Valizadeh",
    "summary": "<p>Publication date: December 2025</p><p><b>Source:</b> Physics of Life Reviews, Volume 55</p><p>Author(s): Jeremie Lefebvre, Aref Pariz, Jean-Philippe Thivierge, Axel Hutt</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001290?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.732050Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "This commentary focuses on cortical oscillation entrainment and dynamical systems in neuroscience, with no evident connection to origins of life, prebiotic chemistry, astrobiology, or habitability."
    }
  },
  {
    "title": "La conquête du temps, de l'Égypte à l'ère atomique",
    "summary": "En 2035, la disparition du temps universel coordonné marquera un basculement historique au profit du temps atomique international : pour la première fois, le temps officiel des humains ne dépendra plus du ciel ni de la Terre. Retour sur cinq millénaires d'efforts pour quantifier l'écoulement du temps.",
    "url": "https://www.sciencesetavenir.fr/fondamental/histoire-des-sciences/la-conquete-du-temps-de-l-egypte-a-l-ere-atomique_190064?xtor=RSS-10",
    "published_date": "2026-01-03T13:00:00Z",
    "source_feed": "Sciences et Avenir",
    "hunted_links": [],
    "analysis_result": {
      "score": 0,
      "summary": "A historical overview of human timekeeping and the shift from UTC to an international atomic timescale, with no substantive connection to origins-of-life, astrobiology, habitability, or biosignatures."
    }
  },
  {
    "title": "Remodeling of non-coding RNA regulatory networks: Decoding the pathological mechanisms and new therapeutic paradigms of cardiovascular diseases",
    "summary": "<p>Publication date: March 2026</p><p><b>Source:</b> Physics of Life Reviews, Volume 56</p><p>Author(s): Wangzheqi Zhang, Lei Duan, Changli Wang, Yan Liao, Rui Zhao, Zhaoyu Li, Haoling Zhang, Zengwu Wang, Jing-jing Zhang</p>",
    "url": "https://www.sciencedirect.com/science/article/pii/S1571064525001836?dgcid=rss_sd_all",
    "published_date": "2026-01-03T14:45:38.731312Z",
    "source_feed": "Physics of Life Reviews",
    "hunted_links": [],
    "analysis_result": {
      "score": 15,
      "summary": "Review of non-coding RNA regulatory network remodeling in cardiovascular disease pathogenesis and therapeutics, with only tangential relevance to Origins of Life via modern RNA biology."
    }
  },
  {
    "title": "Evidence of upright walking found in 7-million-year-old Sahelanthropus fossils",
    "summary": "In recent decades, scientists have debated whether a seven-million-year-old fossil was bipedal—a trait that would make it the oldest human ancestor. A new analysis by a team of anthropologists offers powerful evidence that Sahelanthropus tchadensis—a species discovered in the early 2000s—was indeed bipedal by uncovering a feature found only in bipedal hominins.",
    "url": "https://phys.org/news/2025-12-evidence-upright-million-year-sahelanthropus.html",
    "published_date": "2026-01-02T19:00:05Z",
    "source_feed": "Phys.org: Evolution News",
    "hunted_links": [],
    "analysis_result": {
      "score": 30,
      "summary": "Anthropological reanalysis suggests the 7‑million‑year‑old Sahelanthropus tchadensis shows skeletal features consistent with habitual bipedalism, informing early hominin evolution but offering only indirect relevance to origins-of-life research."
    }
  },
  {
    "title": "Episodic positive selection structurally stabilizes the <i>Arabidopsis</i> CONSTANS-like gene COL5 indicating adaptive evolution",
    "summary": "<p>Scientific Reports, Published online: 03 January 2026; <a href=\"https://www.nature.com/articles/s41598-025-34129-6\">doi:10.1038/s41598-025-34129-6</a></p>Episodic positive selection structurally stabilizes the <i>Arabidopsis</i> CONSTANS-like gene COL5 indicating adaptive evolution",
    "url": "https://www.nature.com/articles/s41598-025-34129-6",
    "published_date": "2026-01-03T00:00:00Z",
    "source_feed": "Scientific Reports",
    "hunted_links": [
      "https://authorservices.springernature.com/go/sn/?utm_source=For+Authors&utm_medium=Website_Nature&utm_campaign=Platform+Experimentation+2022&utm_id=PE2022",
      "https://doi.org/10.32942/X2P62N",
      "https://www.nature.com/reprints",
      "https://author-welcome.nature.com/41598",
      "https://www.nature.com/nmiddleeast",
      "https://doi.org/10.1038/s41598-025-34129-6",
      "https://citation-needed.springer.com/v2/references/10.1038/s41598-025-34129-6?format=refman&flavour=citation",
      "https://www.nature.com/nature-research/open-access",
      "https://conferences.nature.com",
      "https://www.springernature.com/gp/librarians/manage-your-account/librarianportal",
      "https://www.springernature.com/gp/librarians/recommend-to-your-library",
      "https://doi.org/10.1101/2025.04.03.646976",
      "https://solutions.springernature.com/",
      "https://www.nature.com/nindia",
      "https://www.springernature.com/",
      "https://www.nature.com/subjects",
      "https://authorservices.springernature.com/language-editing/",
      "https://www.nature.com/naturecareers/",
      "https://www.nature.com/srep.rss",
      "https://journal-alerts.springernature.com/subscribe?journal_id=41598",
      "https://www.nature.com/openresearch/about-open-access/information-for-institutions",
      "https://www.nature.com/natafrica",
      "https://citation-needed.springer.com/v2/references/10.1038/s41598-025-34129-6?format=refman&flavour=references",
      "https://press.nature.com/",
      "https://www.springernature.com/ccpa",
      "https://www.nature.com/immersive/natureawards/index.html",
      "https://authorservices.springernature.com/scientific-editing/",
      "https://support.nature.com/support/home",
      "https://www.nature.com/authors/editorial_policies",
      "https://www.nature.com/briefing/signup/?brieferEntryPoint=MainBriefingBanner",
      "https://www.nature.com/npg_/press_room/press_releases.html",
      "https://www.nature.com/npg_/company_info/index.html",
      "https://masterclasses.nature.com/",
      "https://www.springernature.com/gp/authors/research-data",
      "https://www.springernature.com/gp/librarians/tools-services"
    ],
    "analysis_result": {
      "score": 30,
      "summary": "This study infers episodic positive selection acting on the Arabidopsis CONSTANS-like gene COL5, with structural analyses suggesting adaptive evolution via protein stabilization."
    }
  },
  {
    "title": "Two white-blooded fish, two paths: Icefish and noodlefish independently lose red blood cell function",
    "summary": "Antarctic icefish are famous for living without red blood cells, but they are not alone. A species of needle-shaped, warm-water fish called the Asian noodlefish also lacks hemoglobin and red blood cells. Like icefish, its veins are filled with translucent white blood, said H. William Detrich, professor emeritus of marine and environmental sciences, who collaborated with Chinese scientists on a paper about the strange aquatic creatures published in Current Biology.",
    "url": "https://phys.org/news/2026-01-white-blooded-fish-paths-icefish.html",
    "published_date": "2026-01-02T16:45:17Z",
    "source_feed": "Phys.org: Evolution News",
    "hunted_links": [],
    "analysis_result": {
      "score": 30,
      "summary": "Comparative evolutionary physiology study showing two distantly related fish lineages independently lost hemoglobin/red blood cell function, offering only indirect astrobiology relevance via adaptation to environmental oxygen constraints in aquatic habitats."
    }
  },
  {
    "title": "Une alternative aux bisphénols de nos tickets de caisse : du bois !",
    "summary": "Se débarrasser de n’importe quel bisphénol dans nos tickets de caisse ou nos reçus de carte bancaire&nbsp;? Des chimistes ont imaginé avoir recours à la lignine, un composé du bois, pour une solution \"verte\"&nbsp;et non-toxique.",
    "url": "https://www.sciencesetavenir.fr/fondamental/materiaux/une-alternative-aux-bisphenols-de-nos-tickets-de-caisse-du-bois_190242?xtor=RSS-10",
    "published_date": "2026-01-02T19:00:00Z",
    "source_feed": "Sciences et Avenir",
    "hunted_links": [
      "https://doi.org/10.1126/sciadv.adw9912",
      "https://pmc.ncbi.nlm.nih.gov/articles/PMC3230400/"
    ],
    "analysis_result": {
      "score": 5,
      "summary": "Reports a green-chemistry approach using wood lignin to replace bisphenols in thermal-paper receipts, with minimal direct relevance to origins-of-life or astrobiology."
    }
  },
  {
    "title": "Flowering plant origins: Dosage-sensitive genes suggest no whole-genome duplications in ancestral angiosperm",
    "summary": "Angiosperms, also known as flowering plants, represent the most diverse group of seed plants, and their origin and evolution have long been a central question in plant evolutionary biology. Whole-genome duplication (WGD), or polyploidization, is widely recognized as a key driver of the origin and trait evolution of both seed plants and angiosperms.",
    "url": "https://phys.org/news/2026-01-dosage-sensitive-genes-genome-duplications.html",
    "published_date": "2026-01-02T19:00:08Z",
    "source_feed": "Phys.org: Evolution News",
    "hunted_links": [],
    "analysis_result": {
      "score": 25,
      "summary": "Genomic analysis of dosage-sensitive genes in flowering plants argues against a whole-genome duplication in the ancestral angiosperm lineage, informing plant evolutionary history but only tangentially relevant to origins-of-life questions."
    }
  }
]